#+TITLE: Property-Based Testing

#+STARTUP: inlineimages
#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap result

** Test Your Generators Against Invariants
If our data type needs to hold some invariants, then always test your generators
against those invariants.

#+BEGIN_SRC haskell
:set -package QuickCheck
:set -XTypeApplications

import Test.QuickCheck
import Control.Monad
import Data.Foldable

:{
data Counter
  = WithLock Counter
  | Increment Int
  | Decrement Int
  deriving (Show, Eq)

validCounter :: Counter -> Bool
validCounter (WithLock (WithLock _)) = False
validCounter (WithLock c) = validCounter c
validCounter (Increment n) = n > 0
validCounter (Decrement n) = n > 0

instance Arbitrary Counter where
  arbitrary = do
    n <- suchThat arbitrary (> 0)
    oneof [ pure $ Increment n
          , pure $ Decrement n
          , pure $ WithLock (Increment n)
          , pure $ WithLock (Decrement n)
          ]

prop_validCounter :: Property
prop_validCounter = property validCounter
:}

sample (arbitrary @Counter)

quickCheckWithResult stdArgs { chatty = False } prop_validCounter >>= putStrLn . output
#+END_SRC

#+RESULTS:
#+begin_result
package flags have changed, resetting and loading new packages...
WithLock (Decrement 1)
WithLock (Decrement 1)
WithLock (Increment 1)
Increment 5
Increment 5
Increment 10
Increment 4
WithLock (Decrement 4)
WithLock (Decrement 4)
Increment 8
WithLock (Decrement 13)
+++ OK, passed 100 tests.
#+end_result

